# value_counts() method

#### Return a Series containing counts of unique values.
##### The resulting object will be in descending order so that the first element is the most frequently-occurring element. 
##### Excludes NA values by default.
##### Sort by frequencies, default True.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
?sns.load_dataset

In [7]:
index = pd.Index([3, 1, 2, 3, 4, np.nan])
index

Float64Index([3.0, 1.0, 2.0, 3.0, 4.0, nan], dtype='float64')

In [8]:
index.value_counts()

3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

In [3]:
df=pd.DataFrame({"col1": [1,2,3,4],
                "col2": [444,555,666,444],
                "col3": ["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# value counts

In [4]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [25]:
df.col2.value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
pd.value_counts("df")

df    2
dtype: int64

In [11]:
planets=sns.load_dataset("planets")

In [13]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

# dropna

In [30]:
#dropna'da birşey yazmasssak (default true) null ları göstermez. False ise nan'ları sayar

In [29]:
planets.method.value_counts(dropna=False)#dropna : bool, default True, Don't include counts of NaN.

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

**datagy example**

In [6]:
data = {'Level': ['Beginner', 'Intermediate', 'Advanced', 'Beginner', 'Intermediate', 'Advanced', 'Beginner', 'Intermediate', 'Advanced', 'Beginner', 'Intermediate', 'Advanced', 'Beginner', 'Intermediate', 'Advanced', 'Beginner', 'Intermediate', 'Advanced'], 
        'Students': [10.0, 20.0, 10.0, 40.0, 20.0, 10.0, np.nan, 20.0, 20.0, 40.0, 10.0, 30.0, 30.0, 10.0, 10.0, 10.0, 40.0, 20.0]}

In [9]:
df = pd.DataFrame.from_dict(data)
df

           Level  Students
0       Beginner      10.0
1   Intermediate      20.0
2       Advanced      10.0
3       Beginner      40.0
4   Intermediate      20.0
5       Advanced      10.0
6       Beginner       NaN
7   Intermediate      20.0
8       Advanced      20.0
9       Beginner      40.0
10  Intermediate      10.0
11      Advanced      30.0
12      Beginner      30.0
13  Intermediate      10.0
14      Advanced      10.0
15      Beginner      10.0
16  Intermediate      40.0
17      Advanced      20.0

In [11]:
df["Students"].value_counts()

10.0    7
20.0    5
40.0    3
30.0    2
Name: Students, dtype: int64

In [12]:
df["Level"].value_counts()

Beginner        6
Intermediate    6
Advanced        6
Name: Level, dtype: int64

In [13]:
df["Students"].value_counts(normalize=True)

10.0    0.411765
20.0    0.294118
40.0    0.176471
30.0    0.117647
Name: Students, dtype: float64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Level     18 non-null     object
 1   Students  17 non-null     float64
dtypes: float64(1), object(1)
memory usage: 416.0+ bytes

In [16]:
df["Students"].value_counts(dropna=False, normalize=True)

10.0    0.388889
20.0    0.277778
40.0    0.166667
30.0    0.111111
NaN     0.055556
Name: Students, dtype: float64

In [17]:
df["Students"].value_counts(bins=3)

(9.969000000000001, 20.0]    12
(30.0, 40.0]                  3
(20.0, 30.0]                  2
Name: Students, dtype: int64

In [18]:
df.groupby("Level")["Students"].value_counts()

Level         Students
Advanced      10.0        3
              20.0        2
              30.0        1
Beginner      10.0        2
              40.0        2
              30.0        1
Intermediate  20.0        3
              10.0        2
              40.0        1
Name: Students, dtype: int64